package lesson_5;


// Создать структуру для хранения Номеров паспортов и Фамилий сотрудников организации.
// 123456 Иванов 
// 321456 Васильев 
// 234561 Петрова 
// 234432 Иванов 
// 654321 Петрова 
// 345678 Иванов
// Вывести данные по сотрудникам с фамилией Иванов.


// public class seminar_5 
// {
//     public static void main(String[] args) 
//     {
//         pasports pasports = new pasports();
//         pasports.add("123456", "Иванов");
//         pasports.add("321456", "Васильев ");
//         pasports.add("234561", "Петрова ");
//         pasports.add("234432", "Иванов ");
//         pasports.add("654321", "Петрова ");
//         pasports.add("345678", "Иванов");

//         System.out.println(pasports);
//         System.out.println(pasports.Find_by_Name("Иванов"));
//     }
    
// }